#pragma G++ optimize(2)
#include<cstdio>
#include<cmath>
#define Pi acos(-1.0)
using namespace std;
#define maxn 6000010
#define MOD 1000000007
typedef long long ll;
/****************************************************************
类似16年的DP背包练习赛中的某题

本题x的上限非常大，利用DP一定会超时间或者空间

所以需要利用组合数学的知识
单纯的生成函数也会t掉，所以要把通式推出来

首先简化:x x+1 x+2 x+3 x+4一定是一样的摆法
所以就可以先除5，每个正好被5整除的数除以5
通项公式并没有那么简单
1 2 4 6 9 ....

此处还是写生成函数，然后求通式
1个5和5个1当做两者拆5的方式
(1+x+x^2+x^3+...)(1+x+x^2+x^3+...)(1+x^2+x^4+x^6+...)
=1/(1-x)^3(1+x)
然后幂展开或者求特征方程


(该好好复习数学了)
通式 xn = n^2/4+n+7/8+1/8*(-1)^n
****************************************************************/
int main() {
	ll t,n;
	ll res;
	scanf("%lld", &t);
	while (t--) {
		scanf("%lld", &n);
		n /= 5;
		res = (((n * n - (n & 1)) / 4) + 1 + n) % MOD;
		
		printf("%lld\n", res % MOD);
	}
}
